Revit 2024 API
Schema.GetField Method
 Gets a Field of a given name from the Schema.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public Field GetField(
	string name
)
Visual Basic
Public Function GetField ( _
	name As String _
) As Field
Visual C++
public:
Field^ GetField(
	String^ name
)
Parameters
name
Type: System.String
 The Field name
Return Value
 The Field
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  Reading of Entities of this Schema is not allowed to the current add-in.
See Also
Schema Class
Autodesk.Revit.DB.ExtensibleStorage Namespace